# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.2'
brew 'php@7.4'
brew 'composer'
brew 'imagemagick'
brew 'maria-db'
brew 'apache'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'ray'
cask 'slack'
cask 'the-unarchiver'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'visual-studio-code'
cask '1password-cli'
cask 'basictex'
cask 'calibre'
cask 'libreoffice'
cask 'losslesscut'
cask 'ngrok'
cask 'qlmarkdown'
cask 'responsively'
cask 'wkhtmltopdf'
cask 'xmplify'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask font-fira-code
cask font-lato
cask font-open-sans
cask font-roboto
cask font-source-code-pro
cask font-source-code-pro-for-powerline
cask font-source-sans-pro
cask font-source-serif-pro


# Mac App Store
mas 'Numbers', id: 409203825
mas 'Things', id: 904280696
